app/controllers/pages_controller.rb

  def profile
    # grab the username from the URL as :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      # redirect to 404 (root for now)
      redirect_to root_path, :notice=> "User not found!"
    end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
    @newPost = Post.new

    @toTrust = User.all.last(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "username03"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 6)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5