app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "blahblah"], ["user_id", 6], ["created_at", "2016-08-13 18:18:06.637468"], ["updated_at", "2016-08-13 18:18:06.637468"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if (@post.save)