app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
---
    def create
        user = User.find(params[:trusted_by_id])